
using System.Text.RegularExpressions;

string pattern = @"\b[A-Z][a-z]+ [A-Z][a-z]+\b"; // "\b"(граница на думата, която указва, откъде точно да търси съвпадение, за да се избегнат фалшиви съвпадения, ако има имена с повече от една главна буква) се слага само пред патерна за първата дума и след патерна за втората дума, защото в края на първата и началото на втората е ясно дефинирано, че първата дума завършва с малка буква и е следвана от празно място, както и втората започва с главна буква след празно място. Т.е. няма как да хване нещо, което се различава от този патерн

//Regex regex = new Regex(pattern);
Regex regex = new Regex(@"\b[A-Z][a-z]+ [A-Z][a-z]+\b"); // ако напишем патерна директно в регекса, самият патерн се визуализира по-нагледно.

string input = Console.ReadLine();

MatchCollection matches = regex.Matches(input);

Console.WriteLine(string.Join(" ", matches));